In [1]:
#first we will split out dataset using company
#   google                   facebook                 ABC Pharma#
#Then google is divided into 03 part 1.Bussubess manager ,computer programmer,Sales Executive
#Then Computer Programmer is divided into two part Bachlors or master
#so at every step the decision is taken.
#you should use the approch which have high information gain
#Gini Impurity- an impurity are in data base
#example in your dataset all the point of attribute are red and one point is green that is known as Gini impurities

In [2]:
import pandas as pd
df=pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
inputs=df.drop("salary_more_then_100k",axis='columns')
target=df['salary_more_then_100k']

In [4]:
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [5]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [6]:
from sklearn.preprocessing import LabelEncoder

In [7]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [8]:
inputs['company_n']=le_company.fit_transform(inputs['company'])
inputs['job_n']=le_job.fit_transform(inputs['job'])
inputs['le_degree']=le_degree.fit_transform(inputs['degree'])

In [9]:
inputs

       company                  job     degree  company_n  job_n  le_degree
0       google      sales executive  bachelors          2      2          0
1       google      sales executive    masters          2      2          1
2       google     business manager  bachelors          2      0          0
3       google     business manager    masters          2      0          1
4       google  computer programmer  bachelors          2      1          0
5       google  computer programmer    masters          2      1          1
6   abc pharma      sales executive    masters          0      2          1
7   abc pharma  computer programmer  bachelors          0      1          0
8   abc pharma     business manager  bachelors          0      0          0
9   abc pharma     business manager    masters          0      0          1
10    facebook      sales executive  bachelors          1      2          0
11    facebook      sales executive    masters          1      2          1
12    facebook     business manager  bachelors          1      0          0
13    facebook     business manager    masters          1      0          1
14    facebook  computer programmer  bachelors          1      1          0
15    facebook  computer programmer    masters          1      1          1

In [10]:
inputs_n=inputs.drop(['company','job','degree'],axis='columns')

In [11]:
inputs_n

    company_n  job_n  le_degree
0           2      2          0
1           2      2          1
2           2      0          0
3           2      0          1
4           2      1          0
5           2      1          1
6           0      2          1
7           0      1          0
8           0      0          0
9           0      0          1
10          1      2          0
11          1      2          1
12          1      0          0
13          1      0          1
14          1      1          0
15          1      1          1

In [12]:
from sklearn import tree

In [13]:
model=tree.DecisionTreeClassifier()

In [14]:
from sklearn.model_selection import train_test_split

In [15]:
X_train,X_test,y_train,y_test=train_test_split(inputs_n[['company_n','job_n','le_degree']],df.salary_more_then_100k,test_size=0.2,random_state=10)

In [16]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [17]:
model.predict(X_test)

array([0, 1, 1, 0], dtype=int64)

In [18]:
y_test

5     1
3     1
14    1
7     0
Name: salary_more_then_100k, dtype: int64

In [19]:
model.score(X_test,y_test)

0.75

In [20]:
model.predict([[2,2,1]])

C:\Users\ronak\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)